bench/results/endpoint-sweep-20260427-041422/hyper-10m.h2load.txt
starting benchmark...
spawning thread #0: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #1: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #2: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #3: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
Warm-up started for thread #3.
Warm-up started for thread #0.
Warm-up started for thread #2.
progress: 50% of clients started
progress: 100% of clients started
Warm-up started for thread #1.
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2

finished in 9.11s, 738.62 req/s, 7.22GB/s
requests: 5909 total, 5909 started, 5909 done, 5909 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 5890 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 57.76GB (62023674099) total, 73.73KB (75496) headers (space savings 82.65%), 65.21GB (70015647744) data
                     min         max         mean         sd        +/- sd
time for request:     6.67ms    647.29ms     99.37ms     62.22ms    88.05%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :      64.97      121.30       91.89       15.49    75.00%