bench/results/endpoint-sweep-20260427-041422/hyper-1k.h2load.txt
starting benchmark...
spawning thread #0: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #1: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #2: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #3: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
Warm-up started for thread #0.
Warm-up started for thread #3.
Warm-up started for thread #1.
progress: 50% of clients started
progress: 100% of clients started
Warm-up started for thread #2.
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #Warm-up phase is over for thread #2.
1Main benchmark duration is started for thread #2.
.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #Main benchmark duration is over for thread #31. Stopping all clients.. Stopping all clients.

Stopped all clients for thread #1
Stopped all clients for thread #3
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2

finished in 9.00s, 284157.88 req/s, 284.54MB/s
requests: 2273263 total, 2273263 started, 2273263 done, 2273263 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 2273263 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 2.22GB (2386927622) total, 19.51MB (20458072) headers (space savings 86.88%), 2.44GB (2618397696) data
                     min         max         mean         sd        +/- sd
time for request:       20us     12.85ms       263us       126us    70.94%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :   35456.04    35617.11    35519.11       57.13    75.00%