bench/results/endpoint-sweep-20260427-041422/hyper-1m.h2load.txt
starting benchmark...
spawning thread #0: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #1: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #2: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #3: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
Warm-up started for thread #0.
Warm-up started for thread #1.
Warm-up started for thread #2.
Warm-up started for thread #3.
progress: 50% of clients started
progress: 100% of clients started
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3

finished in 9.01s, 4694.12 req/s, 4.58GB/s
requests: 37553 total, 37553 started, 37553 done, 37553 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 37512 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 36.67GB (39378273928) total, 418.12KB (428150) headers (space savings 84.31%), 41.63GB (44697468928) data
                     min         max         mean         sd        +/- sd
time for request:      599us    101.20ms     15.45ms     12.90ms    81.38%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :     556.07      606.06      586.55       16.23    75.00%