bench/results/endpoint-sweep-20260427-041422/hyper-echo16k.h2load.txt
starting benchmark...
spawning thread #0: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #1: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #2: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #3: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
Warm-up started for thread #0.
Warm-up started for thread #1.
Warm-up started for thread #3.
progress: 50% of clients started
Warm-up started for thread #2.
progress: 100% of clients started
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3

finished in 9.00s, 137317.88 req/s, 2.10GB/s
requests: 1098543 total, 1098543 started, 1098543 done, 1098543 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1098543 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 16.79GB (18028896935) total, 10.60MB (11119819) headers (space savings 85.48%), 18.85GB (20239663104) data
                     min         max         mean         sd        +/- sd
time for request:       44us      4.66ms       514us       225us    73.20%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :   17083.26    17201.74    17164.26       37.53    87.50%