bench/results/endpoint-sweep-20260427-041422/hyper-tiny.h2load.txt
starting benchmark...
spawning thread #0: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #1: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #2: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
spawning thread #3: 2 total client(s). Timing-based test with 1s of warm-up time and 8s of main duration for measurements.
Warm-up started for thread #3.
Warm-up started for thread #1.
Warm-up started for thread #0.
Warm-up started for thread #2.
progress: 50% of clients started
progress: 100% of clients started
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Warm-up phase is over for thread #Warm-up phase is over for thread #2.3
.
Main benchmark duration is started for thread #2.
Main benchmark duration is started for thread #3.
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #2Main benchmark duration is over for thread #. Stopping all clients.
Stopped all clients for thread #2
3. Stopping all clients.
Stopped all clients for thread #3

finished in 9.00s, 328311.25 req/s, 8.14MB/s
requests: 2626490 total, 2626490 started, 2626490 done, 2626490 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 2626490 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 65.13MB (68290212) total, 16.87MB (17693578) headers (space savings 89.65%), 5.62MB (5897246) data
                     min         max         mean         sd        +/- sd
time for request:       19us      3.93ms       226us        99us    66.76%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :   40939.98    41130.45    41038.43       70.05    62.50%